<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/bill4/14_31_jan_bill4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git

Cloning into 'kansepur-flyash-project'...
remote: Enumerating objects: 109, done.
remote: Counting objects: 100% (109/109), done.
remote: Compressing objects: 100% (97/97), done.
remote: Total 209 (delta 47), reused 0 (delta 0), pack-reused 100
Receiving objects: 100% (209/209), 538.93 KiB | 25.66 MiB/s, done.
Resolving deltas: 100% (88/88), done.

In [0]:
import pandas as pd

In [3]:
%cd ./kansepur-flyash-project/bill4/

/content/kansepur-flyash-project/bill4

In [4]:
!ls

kansepur_bill4.xlsx

In [5]:
df = pd.read_excel('kansepur_bill4.xlsx', 'Sheet1')
df.head()

   S.No.       Date  Count      Name  Quantity
0    1.0 2019-01-15    1.0  mustakim       405
1    2.0        NaT    2.0    shabir       470
2    3.0        NaT    3.0     isran       470
3    4.0        NaT    4.0   farookh       420
4    5.0        NaT    5.0     aarif       416

In [6]:
df.tail(2)

     S.No. Date  Count     Name  Quantity
345  346.0  NaT   40.0  mehmood       538
346    NaN  NaT    NaN      NaN    154904

In [7]:
df = df[:-1]
df.tail(1)

     S.No. Date  Count     Name  Quantity
345  346.0  NaT   40.0  mehmood       538

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 346 entries, 0 to 345
Data columns (total 5 columns):
S.No.       346 non-null float64
Date        11 non-null datetime64[ns]
Count       346 non-null float64
Name        346 non-null object
Quantity    346 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 13.6+ KB

In [9]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-01-15
2    2019-01-16
3    2019-01-20
4    2019-01-21
5    2019-01-24
6    2019-01-25
7    2019-01-26
8    2019-01-27
9    2019-01-28
10   2019-01-29
11   2019-01-30
dtype: datetime64[ns]

In [10]:
df.Date.nunique()

11

In [11]:
df.Date.value_counts()

2019-01-21    1
2019-01-24    1
2019-01-27    1
2019-01-30    1
2019-01-16    1
2019-01-25    1
2019-01-28    1
2019-01-20    1
2019-01-26    1
2019-01-29    1
2019-01-15    1
Name: Date, dtype: int64

In [0]:
import numpy as np

### Fill Date

In [0]:
for n, i in enumerate(df.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    df.iloc[n, 0] = date

In [14]:
df.head(2)

                           S.No.       Date  Count      Name  Quantity
0                              1 2019-01-15    1.0  mustakim       405
1  2019-01-15T00:00:00.000000000        NaT    2.0    shabir       470

In [15]:
df.Name.unique()

array(['mustakim', 'shabir', 'isran', 'farookh', 'aarif', 'toheed',
       'kayum', 'intazar', 'rasid', 'wajid', 'hasan', 'rafakat', 'haseen',
       'aashu', 'gulfam', 'irsad', 'mehmood', 'jabir', 'shokeen', 'momin',
       'khurseed', 'anwar', 'amjad'], dtype=object)

In [16]:
sum(df.Quantity)

154904

In [17]:
quantity_per_name = df.Name.value_counts()
quantity_per_name

rasid       26
hasan       26
farookh     25
isran       24
gulfam      23
haseen      22
mustakim    19
momin       19
khurseed    18
shokeen     18
toheed      18
irsad       15
wajid       15
rafakat     13
aarif       12
aashu       12
jabir        9
shabir       9
anwar        7
kayum        6
amjad        5
mehmood      4
intazar      1
Name: Name, dtype: int64

### Counts per Date

In [18]:
df.isnull().sum()

S.No.         0
Date        335
Count         0
Name          0
Quantity      0
dtype: int64

## unique feets per name

In [19]:
group = df.groupby(df.Name)
group

In [20]:
for i, j in group:
  print(i, '\n', j.Quantity, '\n')

aarif
 4      416
19     416
32     416
145    416
158    416
167    416
180    416
193    416
208    416
231    416
245    416
261    416
Name: Quantity, dtype: int64

aashu
 13     430
36     430
42     430
50     430
57     430
238    430
258    430
274    430
303    430
315    430
326    430
340    430
Name: Quantity, dtype: int64

amjad
 286    411
297    411
312    411
327    411
342    411
Name: Quantity, dtype: int64

anwar
 95     395
102    395
142    395
160    395
230    395
244    395
260    395
Name: Quantity, dtype: int64

farookh
 3      420
16     420
70     420
79     420
93     420
100    420
106    420
107    420
117    420
126    420
134    420
144    420
156    420
169    420
183    420
194    420
218    420
233    420
246    420
263    420
278    420
294    420
307    420
328    420
344    420
Name: Quantity, dtype: int64

gulfam
 20     500
33     500
53     500
63     500
77     500
87     500
97     500
109    500
119    500
131    500
141    500
154    500
168    500
189    500
200    500
210    500
220    500
242    500
267    500
288    500
302    500
308    500
329    500
Name: Quantity, dtype: int64

hasan
 10     538
29     538
43     538
54     538
66     538
75     538
85     538
91     538
98     498
115    508
128    538
137    538
149    538
162    538
172    538
188    538
201    538
211    538
226    538
255    488
270    538
285    538
301    538
313    538
330    538
343    538
Name: Quantity, dtype: int64

haseen
 12     496
27     496
45     496
72     496
83     496
111    496
125    496
135    496
147    496
161    496
173    496
181    496
202    496
215    496
222    496
241    496
257    496
268    496
283    496
298    496
317    496
332    496
Name: Quantity, dtype: int64

intazar
 7    517
Name: Quantity, dtype: int64

irsad
 25     435
37     435
46     435
56     435
122    435
132    435
143    435
155    435
170    435
187    435
198    435
209    435
227    435
249    435
272    435
Name: Quantity, dtype: int64

isran
 2      470
15     470
26     470
39     470
51     470
74     470
81     470
123    470
138    470
152    470
165    470
174    470
179    470
192    470
206    470
217    470
239    470
254    470
265    470
280    470
295    470
309    470
324    470
338    470
Name: Quantity, dtype: int64

jabir
 62     419
68     419
76     419
82     419
88     419
94     419
104    419
279    419
292    419
Name: Quantity, dtype: int64

kayum
 6     450
17    450
28    450
40    450
48    450
58    450
Name: Quantity, dtype: int64

khurseed
 90     410
99     380
105    410
110    410
118    410
127    410
140    410
153    410
166    410
186    410
199    410
214    410
219    410
235    410
252    410
290    410
322    455
336    455
Name: Quantity, dtype: int64

mehmood
 30     420
61     470
341    500
345    538
Name: Quantity, dtype: int64

momin
 73     415
84     415
112    415
124    415
136    415
150    415
163    415
175    415
182    415
196    415
221    415
236    415
251    415
266    415
282    415
304    415
310    415
323    415
337    415
Name: Quantity, dtype: int64

mustakim
 0      405
22     405
108    405
121    405
133    405
146    405
159    405
177    405
178    405
191    405
203    405
212    405
216    405
232    405
247    405
262    405
284    405
306    405
321    405
Name: Quantity, dtype: int64

rafakat
 11     538
23     538
44     538
52     538
60     538
190    538
207    538
229    538
250    538
273    538
291    538
316    538
333    538
Name: Quantity, dtype: int64

rasid
 8      410
21     410
34     410
65     410
89     410
96     410
101    410
114    410
120    410
129    410
148    410
157    410
171    410
185    410
195    410
204    410
213    410
224    410
237    410
253    410
269    410
281    410
296    410
314    410
325    410
339    410
Name: Quantity, dtype: int64

shabir
 1      470
14     470
35     470
38     470
47     470
55     470
275    470
320    470
334    470
Name: Quantity, dtype: int64

shokeen
 67     453
71     453
80     453
139    453
151    453
164    453
176    453
184    453
197    453
205    453
223    453
234    453
256    453
276    453
289    453
300    453
318    453
331    453
Name: Quantity, dtype: int64

toheed
 5      486
18     486
31     486
41     486
49     486
59     486
64     486
69     486
225    320
240    320
248    320
264    320
277    320
293    320
305    320
311    320
319    320
335    320
Name: Quantity, dtype: int64

wajid
 9      419
24     419
78     419
86     419
92     419
103    419
113    419
116    419
130    419
228    419
243    419
259    419
271    419
287    419
299    419
Name: Quantity, dtype: int64

In [21]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

aarif [416]

aashu [430]

amjad [411]

anwar [395]

farookh [420]

gulfam [500]

hasan [538 498 508 488]

haseen [496]

intazar [517]

irsad [435]

isran [470]

jabir [419]

kayum [450]

khurseed [410 380 455]

mehmood [420 470 500 538]

momin [415]

mustakim [405]

rafakat [538]

rasid [410]

shabir [470]

shokeen [453]

toheed [486 320]

wajid [419]

# Diesel

In [22]:
diesel = pd.read_excel('kansepur_bill4.xlsx', 'Diesel')
diesel.head()

,Name,2019-01-15 00:00:00,2019-01-16 00:00:00,2019-01-20 00:00:00,2019-01-21 00:00:00,2019-01-24 00:00:00
0,aarif,2000,0,0,0,NaN
1,aashu,2000,2000,0,0,NaN
2,farookh,2000,0,0,2000,NaN
3,gulfam,2000,0,2000,2000,NaN
4,hasan,2000,1730,1500,1500,NaN

In [23]:
diesel.shape

(24, 6)

In [24]:
df.head(2)

                           S.No.       Date  Count      Name  Quantity
0                              1 2019-01-15    1.0  mustakim       405
1  2019-01-15T00:00:00.000000000        NaT    2.0    shabir       470

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [26]:
name_total_quantity

        Name Total Quantity
6      hasan          13868
5     gulfam          11500
10     isran          11280
7     haseen          10912
18     rasid          10660
4    farookh          10500
20   shokeen           8154
15     momin           7885
16  mustakim           7695
13  khurseed           7440
21    toheed           7088
17   rafakat           6994
9      irsad           6525
22     wajid           6285
1      aashu           5160
0      aarif           4992
19    shabir           4230
11     jabir           3771
3      anwar           2765
12     kayum           2700
2      amjad           2055
14   mehmood           1928
8    intazar            517

In [27]:
diesel.head(1)

,Name,2019-01-15 00:00:00,2019-01-16 00:00:00,2019-01-20 00:00:00,2019-01-21 00:00:00,2019-01-24 00:00:00
0,aarif,2000,0,0,0,NaN

In [28]:
diesel = diesel[['Name', 'Total Diesel']]
diesel.sort_values(by = 'Total Diesel', ascending = False, inplace = True)
diesel

KeyError: ignored

In [0]:
name_total_quantity.shape

In [0]:
diesel.shape

In [0]:
final = pd.DataFrame(columns = ['Name','Count' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel','Balance(Amount - Diesel)'])
for i in range(len(name_total_quantity)):
  for j in range(len(diesel)):
    if name_total_quantity.Name[i] == diesel.Name[j]:
      final = final.append({'Name': diesel.Name[j],'Total Quantity':name_total_quantity['Total Quantity'][i] ,
                            'Count':quantity_per_name.get(diesel.Name[j]),
                            'Amount':name_total_quantity['Total Quantity'][i]*3,
                            'Diesel':diesel['Total Diesel'][j],
                            'Amount - Diesel':name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j],
                           'Balance(Amount - Diesel)': name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j]},
                           ignore_index = True)

In [0]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

In [0]:
final.shape

# Total payable

In [0]:
sum(final['Amount - Diesel'])

# Total Diesel to peoples

In [0]:
sum(final['Diesel'])

In [0]:
to_tractors = sum(final['Total Quantity'])
to_tractors

In [0]:
to_tractors + name_total_quantity[name_total_quantity.Name == 'mehmood']['Total Quantity']